export const categoryColors: { [key: string]: string } = {
    "किराने का सामान": "#FFD700", // Gold
    "किराया": "#FF6347", // Tomato
    "वेतन": "#32CD32", // LimeGreen
    "पुस्तक विक्रय": "#6495ED", // CornflowerBlue
    "उपयोगिताओं": "#00CED1", // DarkTurquoise
    "इलेक्ट्रानिक्स": "#8A2BE2", // BlueViolet
    "बाहर खाएं": "#FFA07A", // LightSalmon
    "नाश्ता": "#FFDEAD", // NavajoWhite
    "निजी उत्पाद": "#F0E68C", // Khaki
    "दिवाली उत्सव": "#FF69B4", // HotPink
    "नए साल का उत्सव": "#DB7093", // PaleVioletRed
    "उगादी उत्सव": "#CD853F", // Peru
    "बोनस": "#6B8E23", // OliveDrab
    "परामर्श कार्य": "#4682B4", // SteelBlue
     "अंशकालिक नौकरी": "#DAA520", // GoldenRod
    // "Online Sales": "#20B2AA", // LightSeaGreen
    // "Freelance Writing": "#778899", // LightSlateGray
    // "End of Year Bonus": "#5F9EA0", // CadetBlue
    // "Thanksgiving Freelance": "#BDB76B", // DarkKhaki
    "अभाव": "#D3D3D3", // LightGray
  };

  export const categoryEmojies: { [key: string]: string } = {
    "किराने का सामान": "🛒",
    "किराया": "🏠",
    "वेतन": "💰",
    // Freelancing: "👨🏻‍💻",
    "उपयोगिताओं": "💡",
    "इलेक्ट्रानिक्स": "🖥️",
    "बाहर खाएं": "🍽️",
    "नाश्ता": "🥐",
    "निजी उत्पाद": "🏡",
    "दिवाली उत्सव": "🎁",
    "नए साल का उत्सव": "🎉",
    "उगादी उत्सव": "🦃",
    "बोनस": "🎊",
    "परामर्श कार्य": "💼",
    "अंशकालिक नौकरी": "⌚",
    // "Online Sales": "🛒",
    // "Freelance Writing": "✍️",
    // "End of Year Bonus": "🍾",
    // "Thanksgiving Freelance": "🍂",
    "अभाव": "🫰🏼",
  };